Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Regular expression support is provided by the PCRE library package, which is open source software, written by Philip Hazel, and copyright by the University of Cambridge, England.
es: Si el carácter delimitador ha sido usado en la propia expresión, es necesario que sea precedido por una barra inversa.

source: Beginning with PHP 4.2.0 these functions are enabled by default.
es: El delimitador de fin puede ser seguido por varios modificadores que afectarán al resultado.

source: Use --with-pcre-regex=DIR to specify DIR where PCRE 's include and library files are located, if not using bundled library.
es: Examina Modificadores de Patrones.

source: PREG_SET_ORDER
es: Ejemplo 2.

source: This flag is only used with preg_match_all().
es: Ejemplos de patrones no válidos

source: PREG_SPLIT_DELIM_CAPTURE
es: /\w+\s*\w+ / J - el modificador 'J' es desconocido

source: This flag is available since PHP 4.0.5.
es: 1-\d3-\d3-\d4 _BAR_ - falta el delimitador de inicio

source: Note that this changes the return value in an array where very element is an array consisting of the matched string at offset 0 and it 's string offset into subject at offset 1.
es: Nota:

source: 1-\d3-\d3-\d4 _BAR_ - missing starting delimiter
es: Para las funciones de expresiones compatibles con Perl se necesita PHP 4 o PHP 3.0.9 o superior.

source: The documentation in this section is only meant to be an overview of the available functions in the PDFlib library and should not be considered an exhaustive reference.
es: You can use the PDF functions in PHP to create PDF files if you have the PDF library by Thomas Merz (available at http: / /www.pdflib.com / pdflib / index.html; you will also need the JPEG library and the TIFF library to compile this.

source: Please consult the documentation included in the source distribution of PDFlib for the full and detailed explanation of each function here.
es: These two libs also quite often make problems when configuring php.

source: It provides a very good overview of what PDFlib is capable of doing and contains the most up-to-date documentation of all functions.
es: Follow the messages of configure to fix possible problems.

source: All of the functions in PDFlib and the PHP module have identical function names and parameters.
es: If you use pdflib 2.01 check how the lib was installed.

source: You will need to understand some of the basic concepts of PDF and PostScript to efficiently use this extension.
es: There should be file or link libpdf.so.

source: There are generally 72 PostScript points to an inch, but this depends on the output resolution.
es: Version 2.01 just creates a lib with the name libpdf2.01.so which cannot be found when linking the test programm in configure.

source: Please see the PDFlib documentation included with the source distribution of PDFlib for a more thorough explanation of the coordinate system used.
es: You will have to create a symbolic link from libpdf.so to libpdf2.01.so.).

source: Please see the examples below for more information.
es: Version 2.20 of pdflib has introduced more changes to its API and support for chinese and japanese fonts.

source: PDFlib is available for download at http: / /www.pdflib.com / pdflib / index.html, but requires that you purchase a license for commercial use.
es: This unfortunately causes some changes of the pdf module of php4 (not php3).

source: Any version of PHP 4 after March 9, 2000 does not support versions of PDFlib older than 3.0.
es: If you use pdflib 2.20 handle the in memory generation of PDF documents with care.

source: PDFlib 3.0 or greater is supported by PHP 3.0.19 and later.
es: Until pdflib 3.0 is released it might be unstable.

source: To get these functions to work, you have to compile PHP with --with-pdflib[ =DIR].
es: The encoding parameter of pdf_set_font() has changed to a string.

source: DIR is the PDFlib base install directory, defaults to / usr / local.
es: This means that instead of e.g.

source: In addition you can specify the jpeg, tiff, and pnglibrary for PDFlib to use, which is optional for PDFlib 4.x.
es: 4 you have to use 'winansi'.

source: To do so add to your configure line the options --with-jpeg-dir[ =DIR] --with-png-dir[=DIR] --with-tiff-dir[=DIR].
es: If you use pdflib 2.30 the pdf_set_text_matrix() will have gone.

source: When using version 3.x of PDFlib, you should configure PDFlib with the option --enable-shared-pdflib.
es: It is not supported any more.

source: Starting with PHP 4.0.5, the PHP extension for PDFlib is officially supported by PDFlib GmbH.
es: In general it is a good advise to consult the release notes of the used version of pdflib for possible changes.

source: This means that all the functions described in the PDFlib manual (V3.00 or greater) are supported by PHP 4 with exactly the same meaning and the same parameters.
es: Since version 3.0 of pdflib you should configure pdflib with the option --enable-shared-pdflib.

source: Only the return values may differ from the PDFlib manual, because the PHP convention of returning FALSE was adopted.
es: Any version of PHP4 after March, 9th 2000 do not support versions of pdflib older than 3.0.

source: For compatibility reasons, this binding for PDFlib still supports the old functions, but they should be replaced by their new versions.
es: PHP3 on the other hand should not be used with version newer than 2.01.

source: Not needed anymore.
es: Most of the functions in pdflib and the PHP module have the same name.

source: pdf_get_bookmark() using the same parameters.
es: You should also understand some of the concepts of PDF or Postscript to efficiently use this module.

source: pdf_get_value() passing "font "as the second parameter.
es: All lengths and coordinates are measured in Postscript points.

source: pdf_get_parameter() passing "fontname "as the second parameter.
es: There is another PHP module for pdf document creation based on FastIO 's.

source: pdf_set_info_creator()
es: ClibPDF.

source: pdf_set_info() passing "Creator "as the second parameter.
es: It has a slightly different API.

source: pdf_set_info() passing "Title "as the second parameter.
es: Check the ClibPDF functions section for details.

source: pdf_set_info() passing "Subject "as the second parameter.
es: Currently all versions of pdflib are supported.

source: pdf_set_info() passing "Author "as the second parameter.
es: It is recommended that you use the newest version since it has more features and fixes some problems which required a patch for the old version.

source: pdf_set_info() passing "Keywords "as the second parameter.
es: Unfortunately, the changes of the pdflib API in 2.x compared to 0.6 have been so severe that even some PHP functions had to be altered.

source: pdf_set_leading()
es: Here is a list of changes:

source: pdf_set_value() passing "leading "as the second parameter.
es: The Info structure does not exist anymore.

source: pdf_set_value() passing "textrendering "as the second parameter.
es: Therefore the function pdf_get_info() is obsolete and the functions pdf_set_info_creator(), pdf_set_info_title(), pdf_set_info_author(), pdf_set_info_subject() and pdf_set_info_keywords() do not take the info structure as the first parameter but the pdf document.

source: pdf_set_value() passing "textrise "as the second parameter.
es: This also means that the pdf document must be opened before these functions can be called.

source: pdf_set_value() passing "horizscaling "as the second parameter.
es: The above functions can and should also be replaced by pdf_set_info()

source: Not available anymore
es: The way a new document is opened has changed.

source: pdf_set_value() passing "charspacing "as the second parameter.
es: The function pdf_open() takes only one parameter which is the file handle of a file opened with fopen().

source: pdf_set_value() passing "wordspacing "as the second parameter.
es: There were some more changes with the release 2.01 of pdflib which should be covered by PHP.

source: pdf_set_parameter() passing "transition "as the second parameter.
es: Some functions are not required anymore (e.g. pdf_put_image()).

source: pdf_new() plus an subsequent call of pdf_open_file()
es: You will get a warning so don 't be shocked.

source: pdf_findfont() plus an subsequent call of pdf_setfont()
es: The pdf module introduces two new types of variables (if pdflib 2.x is used it is only one new type).

source: pdf_set_value() passing "duration "as the second parameter.
es: They are called pdfdoc and pdfinfo (pdfinfo is not existent if pdflib 2.x is used. pdfdoc is a pointer to a pdf document and almost all functions need it as its first parameter. pdfinfo contains meta data about the PDF document.

source: pdf_open_image_file() passing "gif "as the second parameter.
es: It has to be set before pdf_open() is called.

source: pdf_open_jpeg()
es: Nota:

source: pdf_open_image_file() passing "jpeg "as the second parameter.
es: The following is only TRUE for pdflib 0.6.

source: pdf_open_tiff()
es: Read the pdflib manual for newer version

source: pdf_open_png()
es: In order to output text into a PDF document you will need to provide the afm file for each font.

source: pdf_open_image_file() passing "png "as the second parameter.
es: Afm files contain font metrics for a Postscript font.

source: pdf_get_value() passing "imagewidth "as the second parameter and the image as the third parameter.
es: By default these afm files are searched for in a directory named 'fonts' relative to the directory where the PHP script is located. (Again, this was TRUE for pdflib 0.6, newer versions do not not neccessarily need the afm files.)

source: The most difficult part is probably creating your first PDF document.
es: The following example should help to get started.

source: The following example should help to get you started.
es: It uses the PHP functions for pdflib 0.6.

source: It creates test.pdf It creates test.pdf with one page.
es: It creates the file test.pdf with one page.

source: The page contains the text "Times Roman outlined" in an outlined, 30pt font.
es: The page contains the text "Times-Roman" in an outlined 30pt font.

source: Creating a PDF document with PDFlib
es: Creating a PDF document with pdflib 0.6

source: ?php $pdf = pdf_new(); pdf_open_file($pdf, "test.pdf"); pdf_set_info($pdf, "Author", "Uwe Steinmann"); pdf_set_info($pdf, "Title", "Test for PHP wrapper of PDFlib 2.0"); pdf_set_info($pdf, "Creator", "See Author"); pdf_set_info($pdf, "Subject", "Testing"); pdf_begin_page($pdf, 595, 842); pdf_add_outline($pdf, "Page 1"); $font = pdf_findfont($pdf, "Times New Roman", "winansi", 1); pdf_setfont($pdf, $font, 10); pdf_set_value($pdf, "textrendering", 1); pdf_show_xy($pdf, "Times Roman outlined", 50, 750); pdf_moveto($pdf, 50, 740); pdf_lineto($pdf, 330, 740); pdf_stroke($pdf); pdf_end_page($pdf); pdf_close($pdf); pdf_delete($pdf); echo "A HREF=getpdf.php finished / A";?
es: ?php $fp = fopen( "test.pdf", "w"); $info = PDF_get_info(); pdf_set_info_author($info, "Uwe Steinmann"); PDF_set_info_title($info, "Test for PHP wrapper of PDFlib 0.6"); PDF_set_info_author($info, "Name of Author"); pdf_set_info_creator($info, "See Author"); pdf_set_info_subject($info, "Testing"); $pdf = PDF_open($fp, $info); PDF_begin_page($pdf, 595, 842); PDF_add_outline($pdf, "Page 1"); pdf_set_font($pdf, "Times-Roman", 30, 4); pdf_set_text_rendering($pdf, 1); PDF_show_xy($pdf, "Times Roman outlined", 50, 750); pdf_moveto($pdf, 50, 740); pdf_lineto($pdf, 330, 740); pdf_stroke($pdf); PDF_end_page($pdf); PDF_close($pdf); fclose($fp); echo "A HREF=getpdf.php3 finished / A";?

source: The script getpdf.php just returns the pdf document.
es: The PHP script getpdf.php3 just outputs the pdf document.

source: ?php $len = filesize( $filename); header("Content-type: application / pdf"); header("Content-Length: $len"); header("Content-Disposition: inline; filename=foo.pdf"); readfile($filename);?
es: ?php $fp = fopen( "test.pdf", "r"); header("Content-type: application / pdf"); fpassthru($fp); fclose($fp);?

source: The PDFlib distribution contains a more complex example which creates a page with an analog clock.
es: Creating a PDF document with pdflib 2.x

source: The example was converted to PHP from the PDFlib example. (The same example is available in the CLibPDF documentation.)
es: The PHP script getpdf.php3 is the same as above.

source: Example 2. pdfclock example from PDFlib distribution
es: Ejemplo 3. pdfclock example from pdflib 2.x distribution

source: An alternative PHP module for PDF document creation based on FastIO' s An alternative PHP module for PDF document creation based on FastIO's ClibPDF is available.
es: The PHP script getpdf.php3 just outputs the pdf document.

source: Note that ClibPDF has a slightly different API than PDFlib.
es: ?php $fp = fopen( $filename, "r"); header("Content-type: application / pdf"); fpassthru($fp); fclose($fp);?

source: Be sure to read the Payflow Pro Developers Guide for full details of the required parameters.
es: Once you have downloaded the SDK you should copy the files from the lib directory of the distribution.

source: "test.signio.com"
es: Nota:

source: It provides SQL92 / SQL99 language support, transaction integrity and type extensibility.
es: Postgres, desarrollado originalmente en el UC Berkeley Computer Science Department, ha sido pionero en muchos de los conceptos relacionales / orientados a objeto que ahora están empezando a estar disponibles en algunas bases de datos comperciales.

source: To use PostgreSQL support, you need PostgreSQL 6.5 or later, PostgreSQL 7.0 or later to enable all PostgreSQL module features.
es: Tiene soporte de lenguaje SQL92 / SQL3, integridad transaccional, y extensibilidad de tipos.

source: The current version and more information about PostgreSQL is available at http: / /www.postgresql.org /.
es: PostgreSQL es un descendiente de dominio público, más concretamente open source, del código original de Berkeley.

source: DIR is the PostgreSQL base install directory, defaults to / usr / local / pgsql.
es: PostgreSQL se encuentra disponible sin coste alguno.

source: The maximum number of Postgres connections per process, including persistent connections.
es: Desde la versión 6.3 (02 / 03 / 1998) PostgreSQL usa sockets tipo Unix.

source: Use 4.1.0 or later.
es: Abajo se da una tabla con las diferentes posibilidades.

source: Most of new names will have additional underscores, e.g. pg_lo_open().
es: El socket se encuentra en el ficheero / tmp / .s.PGSQL.5432.

source: Older names can be used in 4.2.0 and a few releases from 4.2.0, but they may be deleted in the future.
es: Esta opción se controla mediante el flag '-i' del postmaster y cuando se incluye significa "escuchar sockets TCP / IP además de los de dominio Unix "ya que si no se le dice nada solo escucha sockets tipo Unix.

source: Function names changed
es: Tabla 1.

source: pg_affected_rows()
es: Postmaster y PHP

source: pg_field_size()
es: Estado

source: pg_field_is_null()
es: pg_connect( "","", "","", "dbname");

source: Please use a connection string for pg_connect() and pg_pconnect().
es: pg_connect( "","", "","", "dbname");

source: Since version 6.3 (03 / 02 / 1998) PostgreSQL uses unix domain sockets by default.
es: pg_connect( "localhost", "","", "", "dbname");

source: This option can be enabled with the '-i' flag to postmaster and it's meaning is: "listen on TCP / IP sockets as well as Unix domain sockets ".
es: Is the postmaster running and accepting TCP / IP (with -i) connection at 'localhost 'on port '5432'? in / path / to / file.php3 on line 20. (Imposible conectar al servidor PostgreSQL, la llamada connectDB() ha fallado: ¿Está funcionando el postmaster aceptando conextiones TCP / IP (con -i) en 'localhost' en el puerto '5432 '? en / path / to / file.php3 en linea 20.

source: Is the postmaster running and accepting TCP / IP (with -i) connection at'localhost 'on port '5432'? in / path / to / file.php on line 20.
es: pg_connect( "localhost", "","", "", "dbname");

source: For example, PostgreSQL module will lookup PGHOST environment variable when the hostname is omitted in the connection string.
es: Uno puede establecer una conexión con el siguiente comando:

source: Refer to PostgreSQL Programmer' s Manual (libpq - Environment Variables) for details.
es: Para usar el interface de objetos grandes (large object o lo), es necesario encapsularlo en un bloque de transacción.

source: Use $_ENV or getenv() to check which environment variables are available to the current process.
es: Un bloque de transacción empieza con un begin y si la transacción fue valida termina con commit y end.

source: Setting default parameters
es: Si la transacción falla debe ser cerrada con abort y rollback.

source: In older versions, this was limited to the block size (default was 8KB, maximum was 32KB, defined at compile time)
es: Usando Objetos Grandes (lo)

source: A transaction block starts with a SQL statement BEGIN and if the transaction was valid ends with COMMIT or END.
es: ?php $database = pg_Connect ("","", "","", "jacarta"); pg_exec ($database, "begin"); $oid = pg_locreate ($database); echo ("$oid\n"); $handle = pg_loopen ($database, $oid, "w"); echo ("$handle\n"); pg_lowrite ($handle, "gaga"); pg_loclose ($handle); pg_exec ($database, "commit") pg_exec ($database, "end")?

source: POSIX.1 for example defined the open(), read(), write() and close() functions, too, which traditionally have been part of PHP 3 for a long time.
es: Este módulo contiene una interfaz a aquellas funciones definidas en el documento estandar IEEE 1003.1 (POSIX.1) que no son accesibles de otra manera.

source: It' s therefore strongly advised to disable the POSIX extension at all (use --disable-posix in your configure line) if you're operating in such an environment.
es: POSIX.1 por ejemplo definió las funciones open( ),read(), write() y close(), las cuales han sido parte de PHP durante mucho tiempo.Algunas funciones específicas del sistema no habian estado disponibles antes, aunque con este módulo se intenta remediar esto ofreciendo un acceso fácil a esas funciones.

source: If you have the libraries needed add the --with-pspell[ =dir] option when compiling PHP.
es: The pspell() functions allow you to check the spelling of a word and offer suggestions.

source: These are functions that provide editable command lines.
es: Las funciones readline() implementan una interfaz con la librería GNU Readline.

source: Because of the interactive nature of this library, it will be of little use for writing Web applications, but may be useful when writing scripts meant using PHP from the command line.
es: Un ejemplo de la manera de funcionar podría ser la forma en que el Bash permite usar las flechas de dirección para insertar carácteres o desplazarse a través del historial de comandos.

source: You can find libreadline on the home page of the GNU Readline project, at http: / /cnswww.cns.cwru.edu / ~chet / readline / rltop.html.
es: Debido a la naturaleza interactiva de esta libreria, tendrá un uso muy reducido en la escritura de aplicaciones Web, aunque puede ser útil para scripts que han de ser ejecutados desde la consola.

source: The libedit library is BSD licensend and available for download from http: / /sourceforge.net / projects / libedit /.
es: La página principal del proyecto GNU Readline es http: / /cnswww.cns.cwru.edu / ~chet / readline / rltop.html.

source: The GNU Recode library converts files between various coded character sets and surface encodings.
es: Este modulo contiene un interfaz para la biblioteca GNU Recode version 3.5.

source: The library recognises or produces nearly 150 different character sets and is able to convert files between almost any pair.
es: Para poder usar las funciones definidas en este modulo, debereis de compilar el interprete PHP con la opcion --with-recode.

source: You must have GNU Recode 3.5 or higher installed on your system.
es: Para poder hacer esto debereis tener instalado en vuestro sistema GNU Recode 3.5 o superior.

source: To be able to use the functions defined in this module you must compile your PHP interpreter using the --with-recode[ =DIR] option.
es: La biblioteca GNU Recode convierte entre ficheros con diferentes codigos de caracteres y codificacion.

source: Loading the recode before those extension has proven to fix the problem.
es: Cuando esto no puede realizarse exactamente, puede desahacerse de los caracteres problematicos o crear una aproximacion.

source: This is due to the fact that they both share the same internal symbol.
es: La gran mayoria de de codigos de caracteres RFC 1345 estan soportados.

source: Those functions support non-greedy matching, assertions, conditional subpatterns, and a number of other features not supported by the POSIX-extended regular expression syntax.
es: Las expresiones regulares se usan en PHP para manipular cadenas complejas.

source: The functions that support regular expressions are:
es: Las funciones que soportan expresiones regulares son:

source: Regular Expression Examples
es: Ejemplos de expresiones regulares

source: For regular expressions in Perl-compatible syntax have a look at the PCRE functions.
es: ereg( "abc",$string); / * Devuelve true si "abc "se encuentra en $string. * / ereg("^abc",$string); / * Devuelve true si "abc" se encuentra al comienzo de $string. * / ereg("abc$",$string); / * Devuelve true si "abc "se encuentra al final de $string. * / eregi("(ozilla .[23]_BAR_MSIE.3)",$HTTP_USER_AGENT); / * Devuelve true si el navegador cliente es Netscape 2, 3 o MSIE 3. * / ereg("([[:alnum :]]+) ([[:alnum :]]+) ([[:alnum :]]+)", $string,$regs); / * Pone tres palabras separadas por espacios en $regs[1], $regs[2] y $regs[3]. * / $string = ereg_replace("^"," BR ",$string); / * Coloca la etiqueta BR al comienzo de $string. * / $string = ereg_replace("$", "BR ",$string); / * Coloca la etiqueta BR al final de $string. * / $string = ereg_replace("\n" ,"",$string); / * Elimina los caracteres fin-de-línea de $string. * /

source: This module provides wrappers for the System V IPC family of functions.
es: Este módulo provee funciones semáforo utilizando los semaforos de System V.

source: Semaphores may be used to provide exclusive access to resources on the current machine, or to limit the number of processes that may simultaneously use a resource.
es: Los semáforos pueden usarse para obtener acceso exclusivo a algun recurso del ordenador en cuestión, o para limitar el número de procesos que pueden usar un recurso simultaneamente.

source: Shared memory may be used to provide access to global variables.
es: Este módulo provee tambien funciones de memoria compartida, usando el compartimiento de memoria de System V.

source: Different httpd-daemons and even other programs (such as Perl, C,...) are able to access this data to provide a global data-exchange.
es: La memoria compartida puede usarse para proveer acceso a variables globales.

source: Use semaphores for synchronization.
es: Los diferentes demonios http e incluso otros programas, (como Perl, C,...) son capaces de utilizar estos datos, para intercambiarlos de modo global.

source: Limits of Shared Memory by the Unix OS
es: Recuerde que, la memoria compartida NO es segura para los accesos simultáneos.

source: max size of shared memory, normally 131072 bytes
es: Use los semáforos para obtener sincronismo.

source: minimum size of shared memory, normally 1 byte
es: Tabla 1.

source: max amount of shared memory segments on a system, normally 100
es: Limites de la memoria compartida del SO Unix

source: They provide a simple and effective means of exchanging data between processes, without the need for setting up an alternative using unix domain sockets.
es: máximo tamaño de memoria compartida, normalmente 131072 bytes
